app/controllers/articles_controller.rb

  def update
    binding.pry
    @article = Article.find(params[:id])
    @article.update(title: params[:title], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-11-27 19:58:41.409782"], ["id", 1]]